package practice;

// 子数组的最小值之和
// 给定一个整数数组 arr，找到 min(b) 的总和，其中 b 的范围为 arr 的每个（连续）子数组。
// 由于答案可能很大，答案对 1000000007 取模
// 测试链接 : https://leetcode.cn/problems/sum-of-subarray-minimums/
public class Class52_Code03_SumOfSubarrayMinimums {

    int mod = 1000000007;

    // arr = [6,1,2,4,8,3,9,4,1,7]
    //        0,1,2,3,4,5,6,7,8,9
    // 找两边离自己最近最小的，比如 5-3，左边离自己进比自己小的是2-2，右边离自己最近小的是8-1，也就是说在[2,[4,8,3,9,4],1],3是[4,8,3,9,4]之间最小的
    //                                                                                                        3,4,5,6,7
    // 3在该区间以3为最小值的子区间出现的次数为3-5,3-6,3-7 4-5,4-6,4-7, 5-5,5-6,5-7 所以以5-3为最小值的区间最小值和为5*9=45
    // 推导公式为 3*3=(5-2)*(8-5)=(cur - left) * (i - cur)
    // 重复情况怎么办，举个例子 [...,3-2,4-7,5-6,6-5,7-11,8-10,9-5,10-6,11-3,...],9位置5出栈时弹出6位置5并结算
    // 此时组成的区间为[...,2,[7,6,5,11,10,5,6], 3,...]
    //                   3  4 5 6 7  8  9 10  11
    // 6位置的5弹出结算完之后有4-6,4-7,4-8 5-6,5-7,5-8 6-6,6-7,6-8   实际以5为最小值缺少 4-9,4-10 5-9,5-10 6-9,6-10 7-9,7-10 8-9,8-10 9-9,9-10 12种
    // 当9位置5弹出时，结算内容包括 4-9,4-10 5-9,5-10 6-9,6-10 7-9,7-10 8-9,8-10 9-9, 9-10 12种 正好补上了上面应该有的区域
    // 整个4-11区间以5为最小值的区间经过两次出栈结算正好补全了全部可能
    public int sumSubarrayMins(int[] arr) {
        int n = arr.length;
        int[] stack = new int[n];
        int r = 0;
        long ans = 0;
        // 遍历阶段
        for (int i = 0; i < arr.length; i++) {
            // 大压小的栈，出栈并结算，栈顶元素 >= 当前元素出栈
            while (r > 0 && arr[stack[r - 1]] >= arr[i]) {
                // 出栈
                int cur = stack[--r];
                // 考虑左侧越界
                int left = r == 0 ? -1 : stack[r - 1];
                // 计算最小值和
                ans = (ans + (long)(cur - left) * (i - cur) * arr[cur]) % mod;
            }
            // 入栈
            stack[r++] = i;
        }

        // 清算阶段 比如栈里还有[4,9,12]
        //                  [0,8,10]
        while (r > 0) {
            // 右边都是没有比栈顶元素小的，可以考虑越界位置就是最右边比它小的
            // 出栈
            int cur = stack[--r];
            // 考虑左侧越界
            int left = r == 0 ? -1 : stack[r - 1];
            // 计算最小值和
            ans = (ans + (long)(cur - left) * (n - cur) * arr[cur]) % mod;
        }
        return (int)ans;
    }
}
